CSI API ETABS v1

# cSapModelPropAreaSpring Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPropAreaSpring PropAreaSpring { get; }

    ReadOnly Property PropAreaSpring As cPropAreaSpring
    	Get

    Dim instance As cSapModel
    Dim value As cPropAreaSpring

    value = instance.PropAreaSpring

    property cPropAreaSpring^ PropAreaSpring {
    	cPropAreaSpring^ get ();
    }

    abstract PropAreaSpring : cPropAreaSpring with get

#### Property Value

Type: cPropAreaSpring

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com